In [1]:
class Employee:
    def __init__(self,first,last,pay):
        self.first=first
        self.last=last
        self.pay=pay
    
    @property
    def email(self):
        return '{}.{}@gmail.com'.format(sel.first,self.last)
    
    @property
    def firstname(self):
        return '{} {}'.format(self.first,self.last)
    
    def __repr__(self):
        return "Employee('{}','{}',{})".format(self.first,self.last,self.pay)

In [2]:
import sqlite3

In [3]:
conn = sqlite3.connect("employee.db")

In [4]:
emp1 = Employee('John','Smith',80000)
emp2= Employee("Mary","Smith",90000)

In [11]:
emp3 = Employee('Sia','Sharma',90200)

In [13]:
emp4= Employee('Radha','Rani',78000)

In [5]:
c= conn.cursor()

In [8]:
#Syntax1 : insert a row suing format string
c.execute("INSERT INTO employee VALUES('{}','{}',{})".format(emp1.first,emp1.last,emp1.pay))

In [10]:
#Syntax2 : insert a row using tuple
c.execute("INSERT INTO employee VALUES(?,?,?)",(emp2.first,emp2.last,emp2.pay))

In [12]:
#Syntax3 : insert a row using dictionary
c.execute("INSERT INTO employee VALUES(:first,:last,:pay)",{'first':emp3.first,'last':emp3.last,'pay':emp3.pay})

In [14]:
#Syntax3 : insert a row using dictionary
c.execute("INSERT INTO employee VALUES(:fname,:lname,:sal)",{'fname':emp4.first,'lname':emp4.last,'sal':emp4.pay})

In [15]:
conn.commit()

In [16]:
c.execute("SELECT * FROM  employee")
print(c.fetchall())

[('Laxman', 'Kumar', 85000), ('John', 'Smith', 80000), ('Mary', 'Smith', 90000), ('Sia', 'Sharma', 90200), ('Radha', 'Rani', 78000)]

In [17]:
c.execute("SELECT * FROM  employee WHERE last='Smith'")
print(c.fetchall())

[('John', 'Smith', 80000), ('Mary', 'Smith', 90000)]

In [18]:
c.execute("SELECT * FROM  employee WHERE last=?",('Smith',))
print(c.fetchall())

[('John', 'Smith', 80000), ('Mary', 'Smith', 90000)]

In [19]:
c.execute("SELECT * FROM  employee WHERE pay>?",(80000,))
print(c.fetchall())

[('Laxman', 'Kumar', 85000), ('Mary', 'Smith', 90000), ('Sia', 'Sharma', 90200)]

In [20]:
c.execute("SELECT * FROM  employee WHERE last=:lname",{'lname':'Rani'})
print(c.fetchall())

[('Radha', 'Rani', 78000)]

In [21]:
def insert_emp(emp):
    with conn:
        c.execute("INSERT INTO employee VALUES(:fname,:lname,:sal)",{'fname':emp.first,'lname':emp.last,'sal':emp.pay})

In [29]:
def get_emps_by_name(lname):
    with conn:
        c.execute("SELECT * FROM  employee WHERE last=:lname",{'lname':lname})
        return c.fetchall()

In [42]:
def update_pay(emp,pay):
    with conn:
        c.execute(""" UPDATE employee SET pay=:pay 
        WHERE first=:first AND last=:last""",{'first':emp.first,'last':emp.last,'pay':pay})

In [25]:
def remove_emp(emp):
    with conn:
        c.execute("DELETE FROM employee where first=:first AND last=:last",{'first':emp.first,'last':emp.last})

In [26]:
emp5 = Employee('Mickey','Max',78000)

In [27]:
insert_emp(emp5)

In [32]:
emp6 = get_emps_by_name('Smith')
print(emp6)

[('John', 'Smith', 80000), ('Mary', 'Smith', 90000)]

In [43]:
update_pay(emp1,82000)

In [44]:
emp6 = get_emps_by_name('Smith')
print(emp6)

[('John', 'Smith', 82000), ('Mary', 'Smith', 90000)]

In [45]:
remove_emp(emp2)

In [46]:
emp6 = get_emps_by_name('Smith')
print(emp6)

[('John', 'Smith', 82000)]